УТ/src/InformationRegisters/АУ_ИсторияСогласованияДокументов/АУ_ИсторияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АУ_ИсторияСогласованияДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.АУ_СтатусыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/АУ_СтатусыСогласованияДокументов/АУ_СтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АУ_СтатусыСогласованияДокументов</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
</mdclass:Enum>

УТ/src/CommonModules/АУ_УправлениеСогласованиемДокументов/Module.bsl
#Область Интерфейс

Функция ПолучитьСтатусСогласования(Документ, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_ИсторияСогласованияДокументовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.АУ_ИсторияСогласованияДокументов.СрезПоследних(&ДатаСреза, Документ = &Документ) КАК АУ_ИсторияСогласованияДокументовСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Если ЗначениеЗаполнено(Дата) Тогда
		Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаСреза", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Статус <> NULL Тогда
		Возврат Выборка.Статус;
	КонецЕсли;
	
	Возврат Перечисления.АУ_СтатусыСогласованияДокументов.ПустаяСсылка();
	
КонецФункции

Функция ОтправитьДокументНаСогласование(Документ, Исполнитель) Экспорт
	
	ТекущийСтатус = ПолучитьСтатусСогласования(Документ);
	Если ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.НаСогласовании Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Документ %1 уже находится на согласовании", Документ));
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан согласующий !");
		Возврат Ложь;
	КонецЕсли;
	
	ДатаСогласования = ТекущаяДатаСеанса();
	
	рег = РегистрыСведений.АУ_ИсторияСогласованияДокументов.СоздатьНаборЗаписей();
	рег.Отбор.Период.Установить(ДатаСогласования, Истина);
	рег.Отбор.Документ.Установить(Документ, Истина);
	
	Запись = рег.Добавить();
	Запись.Период = ДатаСогласования;
	Запись.Документ = Документ;
	Запись.Статус = Перечисления.АУ_СтатусыСогласованияДокументов.НаСогласовании;
	Запись.Исполнитель = Пользователи.АвторизованныйПользователь();
	
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	Задача.Дата = ДатаСогласования;
	Задача.Наименование = СтрШаблон("Согласование документа: %1", Документ);
	Задача.Автор = Пользователи.АвторизованныйПользователь();
	Задача.Исполнитель = Исполнитель;
	Задача.ДатаИсполнения = КонецДня(ДатаСогласования);
	Задача.ДатаНачала = НачалоДня(ДатаСогласования);
	Задача.Предмет = Документ;
	Задача.ПредметСтрокой = СокрЛП(Документ);
	Задача.СрокИсполнения = КонецДня(ДатаСогласования);
	Задача.АУ_СогласованиеДокументов = Истина;
	Задача.Описание = Задача.Наименование;
	
	Задача.Записать();
	
	Запись.Задача = Задача.Ссылка;
	рег.ОбменДанными.Загрузка = Истина;
	рег.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

Функция СогласоватьДокумент(Документ, Комментарий) Экспорт
	
	ВыполнитьЗадачуСогласованияДокумента(Документ, Истина, Комментарий);
	
КонецФункции

Функция ОтказатьВСогласованииДокумента(Документ, Комментарий) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Комментарий) Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо указать причину отказа",, "АУ_КомментарийКСогласованию");
		Возврат Ложь;
	КонецЕсли;
	
	ВыполнитьЗадачуСогласованияДокумента(Документ, Ложь, Комментарий);
	
КонецФункции

Функция СброситьСогласованиеДокумента(Документ, Причина) Экспорт
	
	ТекущийСтатус = ПолучитьСтатусСогласования(Документ);
	Если НЕ ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.Согласован 
		И НЕ ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.НаСогласовании Тогда
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Документ %1 не согласован, сбросить согласование нельзя", Документ));
		Возврат Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Причина) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указана причина сброса согласования !");
		Возврат Ложь;
	КонецЕсли;
	
	ДатаСогласования = ТекущаяДатаСеанса();
	
	//отменяем текущие задачи
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_ИсторияСогласованияДокументов.Задача КАК Задача
	|ИЗ
	|	РегистрСведений.АУ_ИсторияСогласованияДокументов КАК АУ_ИсторияСогласованияДокументов
	|ГДЕ
	|	АУ_ИсторияСогласованияДокументов.Документ = &Документ
	|	И АУ_ИсторияСогласованияДокументов.Задача.Выполнена = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗадачаОбъект = Выборка.Задача.ПолучитьОбъект();
		ЗадачаОбъект.РезультатВыполнения = "Отменена в связи со сбросом согласования";
		ЗадачаОбъект.ВыполнитьЗадачу();
		
	КонецЦикла;
	
	//меняем статус на НОВЫЙ
	рег = РегистрыСведений.АУ_ИсторияСогласованияДокументов.СоздатьНаборЗаписей();
	рег.Отбор.Период.Установить(ДатаСогласования, Истина);
	рег.Отбор.Документ.Установить(Документ, Истина);
	
	Запись = рег.Добавить();
	Запись.Период = ДатаСогласования;
	Запись.Документ = Документ;
	Запись.Статус = Перечисления.АУ_СтатусыСогласованияДокументов.Новый;
	Запись.Исполнитель = Пользователи.АвторизованныйПользователь();
	
	рег.ОбменДанными.Загрузка = Истина;
	рег.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

Процедура СформироватьЭлементыСогласованияДокументаНаФорме(Форма, Страницы) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		ТекущийСтатус = ПолучитьСтатусСогласования(Форма.Объект.Ссылка);
	Иначе
		ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.Новый;
	КонецЕсли;
	
	Страница = АУ_СозданиеЭлементовФормы.СоздатьСтраница(Форма, "АУ_СтраницаСогласованияДокументов", Страницы, "Согласование", 1, 1, 1);
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.Обновить);
	ПараметрыКоманды.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);
	
	ГруппаСтатус = АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(Форма, "АУ_ГруппаСтатусСогласования", Страница, 3);
	АУ_СозданиеЭлементовФормы.СоздатьДекорацияНадпись(Форма, "АУ_ТекущийСтатусСогласования", ГруппаСтатус, СтрШаблон("Текущий статус : %1", ТекущийСтатус));
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(Форма, "АУ_ОбновитьДанныеПоСогласованию", "Обновить", "АУ_ОбновитьДанныеПоСогласованию");
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(Форма, "АУ_ОбновитьДанныеПоСогласованию", ГруппаСтатус,, "АУ_ОбновитьДанныеПоСогласованию", 1, ПараметрыКоманды);
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("Дата", АУ_СозданиеЭлементовФормы.ОписаниеТипаДатаВремя("ДатаВремя"));
	СтруктураКолонок.Вставить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.АУ_СтатусыСогласованияДокументов"));
	СтруктураКолонок.Вставить("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	СтруктураКолонок.Вставить("Комментарий", АУ_СозданиеЭлементовФормы.ОписаниеТипаСтрока(1000));
	СтруктураКолонок.Вставить("Исполнитель", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(Форма, "АУ_ИсторияСогласованияДокумента", АУ_СозданиеЭлементовФормы.ОписаниеТипаТаблицаЗначений());
	АУ_СозданиеЭлементовФормы.СоздатьРеквизитыТаблицы(Форма, "АУ_ИсторияСогласованияДокумента", СтруктураКолонок);
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("Дата", "Дата");
	СтруктураКолонок.Вставить("Статус", "Статус");
	СтруктураКолонок.Вставить("Автор", "Автор");
	СтруктураКолонок.Вставить("Комментарий", "Комментарий");
	СтруктураКолонок.Вставить("Исполнитель", "Исполнитель");
	АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(Форма, "АУ_ИсторияСогласованияДокумента", Страница, "АУ_ИсторияСогласованияДокумента", СтруктураКолонок);
	Форма.Элементы.АУ_ИсторияСогласованияДокумента.ТолькоПросмотр = Истина;
	
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(Форма, "АУ_Согласующий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	АУ_СозданиеЭлементовФормы.СоздатьПоле(Форма, "АУ_Согласующий", Страница, "Согласующий", 1, "АУ_Согласующий");
	
	ПараметрыПоля = Новый Структура;
	ПараметрыПоля.Вставить("МногострочныйРежим", Истина);
	ПараметрыПоля.Вставить("РастягиватьПоГоризонтали", Истина);
	АУ_СозданиеЭлементовФормы.СоздатьРеквизит(Форма, "АУ_КомментарийКСогласованию", АУ_СозданиеЭлементовФормы.ОписаниеТипаСтрока(1000));
	АУ_СозданиеЭлементовФормы.СоздатьПоле(Форма, "АУ_КомментарийКСогласованию", Страница, "Комментарий", 1, "АУ_КомментарийКСогласованию", ПараметрыПоля);
	
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(Форма, "АУ_ОтправитьНаСогласование", "Отправить на согласование", "АУ_ОтправитьНаСогласование");
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(Форма, "АУ_Согласовать", "Согласовать", "АУ_Согласовать");
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(Форма, "АУ_ОтказатьВСогласовании", "Отказать в согласовании", "АУ_ОтказатьВСогласовании");
	АУ_СозданиеЭлементовФормы.СоздатьКоманду(Форма, "АУ_СброситьСогласование", "Сбросить согласование", "АУ_СброситьСогласование");
	
	ГруппаПодвал = АУ_СозданиеЭлементовФормы.СоздатьГруппаОбычнаяБезОтображения(Форма, "АУ_ГруппаКнопкиСогласования", Страница, 3);
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.ОформлениеСтрелкаВправоЖелтая);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(Форма, "АУ_ОтправитьНаСогласование", ГруппаПодвал,, "АУ_ОтправитьНаСогласование", 1, ПараметрыКоманды);
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.ОформлениеФлажок);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(Форма, "АУ_Согласовать", ГруппаПодвал,, "АУ_Согласовать", 1, ПараметрыКоманды);
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.ОформлениеКрест);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(Форма, "АУ_ОтказатьВСогласовании", ГруппаПодвал,, "АУ_ОтказатьВСогласовании", 1, ПараметрыКоманды);
	ПараметрыКоманды.Вставить("Картинка", БиблиотекаКартинок.ПовернутьПротивЧасовойСтрелки);
	АУ_СозданиеЭлементовФормы.СоздатьКнопка(Форма, "АУ_СброситьСогласование", ГруппаПодвал,, "АУ_СброситьСогласование", 1, ПараметрыКоманды);
	
	ОбновитьДанныеПоСогласованиюНаФорме(Форма);
	
КонецПроцедуры

Процедура ОбновитьДанныеПоСогласованиюНаФорме(Форма) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		
		ТекущийСтатус = ПолучитьСтатусСогласования(Форма.Объект.Ссылка);
		Если НЕ ЗначениеЗаполнено(ТекущийСтатус) Тогда
			ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.Новый;
		КонецЕсли;
		
		Форма.Элементы.АУ_СтраницаСогласованияДокументов.ТолькоПросмотр = Ложь;
		
	Иначе
		
		ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.Новый;
		
		Форма.Элементы.АУ_СтраницаСогласованияДокументов.ТолькоПросмотр = Истина;
		Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Ложь;
		
	КонецЕсли;
	
	Форма.Элементы.АУ_ГруппаКнопкиСогласования.Доступность = ЗначениеЗаполнено(Форма.Объект.Ссылка);
	
	Форма.Элементы.АУ_ТекущийСтатусСогласования.Заголовок = СтрШаблон("Текущий статус : %1", ТекущийСтатус);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_ИсторияСогласованияДокументов.Период КАК Дата,
	|	АУ_ИсторияСогласованияДокументов.Статус КАК Статус,
	|	АУ_ИсторияСогласованияДокументов.Исполнитель КАК Автор,
	|	АУ_ИсторияСогласованияДокументов.Комментарий КАК Комментарий,
	|	АУ_ИсторияСогласованияДокументов.Задача КАК Задача,
	|	АУ_ИсторияСогласованияДокументов.Задача.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.АУ_ИсторияСогласованияДокументов КАК АУ_ИсторияСогласованияДокументов
	|ГДЕ
	|	АУ_ИсторияСогласованияДокументов.Документ = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Документ", Форма.Объект.Ссылка);
	
	ИсторияСогласования = Запрос.Выполнить().Выгрузить();
	
	Форма.АУ_ИсторияСогласованияДокумента.Загрузить(ИсторияСогласования);
	
	Если ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.НаСогласовании Тогда
		
		Если ИсторияСогласования[ИсторияСогласования.Количество() - 1].Исполнитель = Пользователи.АвторизованныйПользователь() Тогда
			
			Форма.Элементы.АУ_Согласующий.Видимость = Ложь;
			Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Истина;
			
			Форма.Элементы.АУ_ОтправитьНаСогласование.Доступность = Ложь;
			Форма.Элементы.АУ_Согласовать.Доступность = Истина;
			Форма.Элементы.АУ_ОтказатьВСогласовании.Доступность = Истина;
			
		Иначе
			
			Форма.Элементы.АУ_Согласующий.Видимость = Ложь;
			Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Ложь;
			
			Форма.Элементы.АУ_ОтправитьНаСогласование.Доступность = Ложь;
			Форма.Элементы.АУ_Согласовать.Доступность = Ложь;
			Форма.Элементы.АУ_ОтказатьВСогласовании.Доступность = Ложь;
			
		КонецЕсли;
		
		Если ИсторияСогласования[ИсторияСогласования.Количество() - 1].Автор = Пользователи.АвторизованныйПользователь() Тогда
			
			Форма.Элементы.АУ_СброситьСогласование.Видимость = Истина;
			Форма.Элементы.АУ_СброситьСогласование.Доступность = Истина;
			Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Истина;
			
		Иначе
			Форма.Элементы.АУ_СброситьСогласование.Видимость = Ложь;
			Форма.Элементы.АУ_СброситьСогласование.Доступность = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.Новый Тогда
		
		Форма.Элементы.АУ_Согласующий.Видимость = Истина;
		Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Ложь;
		
		Форма.Элементы.АУ_ОтправитьНаСогласование.Доступность = Истина;
		Форма.Элементы.АУ_Согласовать.Доступность = Ложь;
		Форма.Элементы.АУ_ОтказатьВСогласовании.Доступность = Ложь;
		Форма.Элементы.АУ_СброситьСогласование.Видимость = Ложь
		
	ИначеЕсли ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.НеСогласован Тогда
		
		Форма.Элементы.АУ_Согласующий.Видимость = Истина;
		Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Ложь;
		
		Форма.Элементы.АУ_ОтправитьНаСогласование.Доступность = Истина;
		Форма.Элементы.АУ_Согласовать.Доступность = Ложь;
		Форма.Элементы.АУ_ОтказатьВСогласовании.Доступность = Ложь;
		Форма.Элементы.АУ_СброситьСогласование.Видимость = Ложь
		
	ИначеЕсли ТекущийСтатус = Перечисления.АУ_СтатусыСогласованияДокументов.Согласован Тогда
		
		Форма.Элементы.АУ_Согласующий.Видимость = Ложь;
		Форма.Элементы.АУ_КомментарийКСогласованию.Видимость = Истина;
		
		Форма.Элементы.АУ_ОтправитьНаСогласование.Доступность = Ложь;
		Форма.Элементы.АУ_Согласовать.Доступность = Ложь;
		Форма.Элементы.АУ_ОтказатьВСогласовании.Доступность = Ложь;
		
		Форма.Элементы.АУ_СброситьСогласование.Видимость = Истина
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ВыполнитьЗадачуСогласованияДокумента(Документ, Результат, Комментарий)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_ИсторияСогласованияДокументовСрезПоследних.Статус КАК Статус,
	|	АУ_ИсторияСогласованияДокументовСрезПоследних.Исполнитель КАК Автор,
	|	АУ_ИсторияСогласованияДокументовСрезПоследних.Комментарий КАК Комментарий,
	|	АУ_ИсторияСогласованияДокументовСрезПоследних.Задача КАК Задача,
	|	АУ_ИсторияСогласованияДокументовСрезПоследних.Задача.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.АУ_ИсторияСогласованияДокументов.СрезПоследних(, Документ = &Документ) КАК АУ_ИсторияСогласованияДокументовСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.Статус = Перечисления.АУ_СтатусыСогласованияДокументов.НаСогласовании Тогда
		
		Если Выборка.Исполнитель <> Пользователи.АвторизованныйПользователь() И Пользователи.РолиДоступны("ПолныеПрава") Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("У вас нет прав на согласование документа %1", Документ));
			Возврат Ложь;
		КонецЕсли;
		
		ДатаСогласования = ТекущаяДатаСеанса();
	
		рег = РегистрыСведений.АУ_ИсторияСогласованияДокументов.СоздатьНаборЗаписей();
		рег.Отбор.Период.Установить(ДатаСогласования, Истина);
		рег.Отбор.Документ.Установить(Документ, Истина);
		
		Запись = рег.Добавить();
		Запись.Период = ДатаСогласования;
		Запись.Документ = Документ;
		Запись.Исполнитель = Пользователи.АвторизованныйПользователь();
		
		Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		Задача.Дата = ДатаСогласования;
		
		Если Результат Тогда
			Запись.Статус = Перечисления.АУ_СтатусыСогласованияДокументов.Согласован;
			Задача.Наименование = СтрШаблон("Ознакомление. Документ согласован: %1", Документ);
			Задача.Описание = СтрШаблон("Пользователь %1 согласовал документ %2. Комментарий: %3", Запись.Исполнитель, Документ, Комментарий);
		Иначе
			Запись.Статус = Перечисления.АУ_СтатусыСогласованияДокументов.НеСогласован;
			Задача.Наименование = СтрШаблон("Ознакомление. Документ НЕ согласован: %1", Документ);
			Задача.Описание = СтрШаблон("Пользователь %1 отказал в согласовании документа %2 по причине: %3", Запись.Исполнитель, Документ, Комментарий);
		КонецЕсли;
		
		Задача.Автор = Пользователи.АвторизованныйПользователь();
		Задача.Исполнитель = Выборка.Автор;
		Задача.ДатаИсполнения = КонецДня(ДатаСогласования);
		Задача.ДатаНачала = НачалоДня(ДатаСогласования);
		Задача.Предмет = Документ;
		Задача.ПредметСтрокой = СокрЛП(Документ);
		Задача.СрокИсполнения = КонецДня(ДатаСогласования);
		Задача.АУ_СогласованиеДокументов = Истина;
		Задача.АУ_ЗадачаОзнакомления = Истина;
		
		Задача.Записать();
		
		Запись.Задача = Задача.Ссылка;
		рег.ОбменДанными.Загрузка = Истина;
		рег.Записать(Истина);
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Документ %1 не находится на согласовании", Документ));
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
